const pages = {

password:{

    type:"password",

    title:"علشان اتأكد انك مش بتشغلي دماغك وبتفتحيه من ورايا ايه الباسورد بتاعه ؟🤔",

    password:"DaLeeN 🐣🫶🏻❤️",

    placeholder:"اكتبي الباسورد...",

    button:"ودي",

   wrong: [
"شكلك مُصممة تفتحيه من ورايا 😂",
"متحاوليش كتير... اسأليني أحسن. 😌",
"يبت خلاص بقا بطلي سنتحه قولنا مش هتعرفيه 😂",
"خلاص خليكي كده... مش بيفتح برضو. 😒"
],
    
    next:"pathChoice"

},

intro:{

    type:"message",

    text:`بصي... علشان تبقي عارفة بس إنتِ داخلة على إيه. 🤍

دي حاجة أنا فكرت فيها من فترة قريبة، تقريبًا وأنا في الامتحانات، بس كانت الفكرة مختلفة شوية.

وطبعًا مجتش الفرصة إني أعملها وقتها.`,

    buttons:[

        {

            text:"اتفضلي خشي على اللي بعده",

            next:"day1"

        }

    ]

},

day1:{

    type:"message",

    text:`أنا دلوقتي بادئ فيها بالظبط يوم 1/8/2026 بالليل.

حاسس إني كان المفروض أعملها بدري شوية، علشان إحنا دلوقتي يعتبر بقينا تمام.

لسه مش عارف هتفهمي البتاع ده إمتى، أو هعرفهولك إمتى...

بس أظن أول ما أحس إننا بقينا زي الأول. 🤍`,

    buttons:[

        {

            text:"كمل كمل",

            next:"ideas"

        }

    ]

},

  ideas:{

    type:"message",

    text:`حاسس إني بخلص كل الأفكار بدري أووييي... 😂😂

وخايف بعدين ملاقيش حاجة أعملهالك، أو حاجة أفاجئك بيها، أو أكرر نفس الحاجة تاني، أو أبقى ممل...

بس تمام. 😂😂`,

    buttons:[

        {

            text:"خش في الموضوع بقى",

            next:"minute"

        }

    ]

},

minute:{

    type:"message",

    text:`المهم بقا بعد كل الرغي ده بقا ممكن اخد دقيقه من وقتك؟ 😅`,

    buttons:[

        {

            text:"اكيد",

            next:"mainIntro"

        },

        {

            text:"معنديش وقت",

            next:"noTime",
             wrong:true
        }

    ]

},

noTime:{

    type:"message",

    text:`لا عندك متستهبليش انتي فاضيه بعد اذنك عايز دقيقه 😒`,

    buttons:[

        {

            text:"ماشي",

            next:"mainIntro"

        },

        {

            text:"انت هتصاحبني ولا ايه",

            next:"marryJoke",
            wrong:true
        }

    ]

},

marryJoke:{

    type:"message",

    text:`لا هتجوزك... مش بمزاجك عمتا كده كده هكمل كلامي 😂`,

    buttons:[

        {

            text:"ارغي",

            next:"mainIntro"

        }

    ]

},

mainIntro:{

    type:"message",

    text:`بصي، لحد ما أنا بدأت بكتب الكلام ده، إنتِ فعلًا بقيتي عسل جدًا... بس لسه مستفزة في حاجات. 😂

وبعتلك إننا بجد خلاص ونرجع تاني مع بعض، مرديتيش وتوهتي... بس برضو ستيل إنتِ عسل. 🤍`,

    buttons:[

        {

            text:"هممم",

            next:"loveTalk"

        }

    ]

},

  loveTalk:{

    type:"message",

    text:`عمومًا... رغم إني بدأت أرجع أقولها، بس وقتها لسه مكنتش بقولها كتير، أو مش عارف أقولها كتير.

بس عمومًا... أنا لسه بحبك.

وحتى وأنا زعلان منك، بحبك. ولو مكنتش بحبك، مكنتش زعلت. لأن ده أصلًا دايمًا بيبقى سبب زعلي منك.

ولازم تفهمي حاجة زي دي... أنا عمري ما زعلت منك بسبب غروري، أو علشان مش سامعة كلامي، أو إني بعاند معاكي، أو إني عايز أشوف نفسي عليكي، أو إن رأيي هو اللي يمشي، أو إني أعمل عليكي راجل.

أنا دايمًا بزعل منك علشان بحبك. 🤍`,

    buttons:[

        {

            text:"كمل",

            next:"memory"

        }

    ]

},

memory:{

    type:"message",

    text:`وبالنسبة لموضوع إني فاكر كل حاجة... معرفش إزاي إنتِ أول مرة تاخدي بالك منه، بس آه، أنا فاكر كل حاجة من بدري.

فاكر كل حاجة قديمة لما كنا صحاب، وفاكر كلامنا وهزارنا، والكلام اللي كان بيتقال في الشات كله.

وفاكر بعد ما رجعنا وبدأنا نقرب، وإحنا بنستعبط، وأنا بلمحلك.

فاكر لما كنا بنسهر نتكلم بالساعات، ونلعب بالساعات.

فاكر كل مرة كنت بقابلك فيها في المترو، وفاكر كل مرة شفتك، وممكن أكون فاكر هزارنا وكلامنا وقتها.

فاكر حتى لما روحنا الجزيرة سوا... كل حاجة، لدرجة إني تقريبًا فاكر إنتِ كنتِ لابسة إيه يومها.

أنا فعلًا فاكر كل حاجة، وصعب أنسى الحاجات دي علشان غالية عليا أوي 🤍`,

    buttons:[

        {

            text:"اممم",

            next:"happy"

        }

    ]

},

happy:{

    type:"message",

    text:`بصي... يمكن مفيش مناسبة لكل ده، ويمكن في حاجات كتير بعملها من غير مناسبة.

بس أنا عايزك تفرحي، مش أكتر.

يمكن علشان دي الطريقة اللي بعرف أحس بيها بحاجات مش هحسها غير كده... أحس منك بحب، وإنك فارق معاكي، وإنك مبسوطة ومقدرة ده جدًا.

ويمكن لو إنتِ لسه في حاجة نقصاكي مني، اللي أنا بعمله ده يعوضك شوية عنها.

المهم ميجيش وقت أحس إنه كان في أكتر أقدر أعمله ومعملتوش، أو أندم إني معملتش كفاية لأنضف بنت عرفتها في حياتي، أو إن طريقتك دي علشان أنا معرفتش أديكي حب كفاية، أو معرفتش أحبك زي ما إنتِ عايزة، أو معرفتش أطمنك كفاية.

يمكن لما أحبك أكتر، وأعمل أكتر، تعرفي تحبيني برضو. 🤍`,

    buttons:[

        {

            text:"كمل",

            next:"cleanIntro"

        }

    ]

},

cleanIntro:{

    type:"message",

    text:`تعالي بقى أشرحلك يعني إيه "أنضف بنت عرفتها في حياتي"، وإيه الكلمة اللي دايمًا بتسمعيها مني دي 😂`,

    buttons:[

        {

            text:"قول",

            next:"clean1"

        }

    ]

},

  clean1:{

    type:"message",

    text:`بصي يا ستي... أولًا، إنتِ أنضف بنت علشان أنا ثقتي فيكي مش بس علشان أنا عارف إنك مش هتعملي حاجة تزعلني، لا... أنا واثق فيكي إنك أصلًا مش هتعملي حاجة غلط من نفسك، علشان إنتِ تربيتك كده، ومتربية بجد صح.

وأنا واثق في تربيتك، وإنك متعمليش حاجة غلط.`,

    buttons:[

        {

            text:"ايه كمان",

            next:"clean2"

        }

    ]

},

clean2:{

    type:"message",

    text:`أنضف بنت علشان إنتِ بجد من جوا معنى كلمة نضيفة.

مش بتغيري من حد، ومش بتنفسني، ومش بتصفري. أنا كنت دايمًا بشوف إن كل البنات عندهم حتة صفار، حتى لو بنسبة وتناسب، بس إنتِ فعلًا معندكيش خالص، وإنتِ أول بنت أشوفها كده.

آه، إنتِ بتعاندي... بس مش بتصفري أو بتغلي، بالعكس، إنتِ قلبك أبيض وطيبة أوي.`,

    buttons:[

        {

            text:"اممم",

            next:"clean3"

        }

    ]

},

clean3:{

    type:"message",

    text:`وآه، إنتِ قلبك أبيض، مش قلبك أسود زي ما بتقولي.

وإنتِ بس بتزعلي، ومش معنى إنك فاكرة موقف بجد زعلك جامد إنك كده قلبك أسود.

يعني أنا لما بقولك على حاجات ضايقتني، يبقى قلبي أسود؟

لا... قلبنا يبقى أسود لو معديناش الحوار وعلقنا عليه المشنقة.

بس إنتِ بتعرفي تسامحي وتعدي، وعادي تبقي فاكرة الموقف، وده الطبيعي.`,

    buttons:[

        {

            text:"انا مش عارفه ارد اقول ايه",

            next:"noReply"

        }

    ]

},

noReply:{

    type:"message",

    text:`مش عايزك تردي على حاجة على فكرة، وإنتِ عارفة.

كفاية بس إنك تبقي مبسوطة.

ولا مرة كنت بعمل حاجة أو أقول حاجة وأبقى مستني منك رد عليها.`,

    buttons:[

        {

            text:"كمل طيب",

            next:"loveQuestion"

        }

    ]

},

  loveQuestion:{

    type:"message",

    text:`المهم بس الأول يا دالين...

إنتِ فعلًا بتحبيني؟`,

    buttons:[

        {
            text:"أيوه طبعًا",
            next:"ringPage"
        },

        {
            text:"لا",
            next:"loveNo1",
            wrong:true
        }

    ]

},

loveNo1:{

    type:"message",

    text:`من ورا قلبك أنا عارف. 🤍`,

    buttons:[

        {
            text:"أيوه بحبك",
            next:"ringPage"
        },

        {
            text:"لا مش من ورا قلبي خالص",
            next:"loveNo2",
            wrong:true
        }

    ]

},

loveNo2:{

    type:"message",

    text:`يبت بطلي سنتحه بقى، مش هنا كمان... ارحميني شوية 😠`,

    buttons:[

        {
            text:"ما أكيد بحبك طبعًا",
            next:"ringPage"
        }

    ]

},

  ringPage:{

    type:"ring",

    title:"افتحيها 🤍",

    text:`يمكن مش عارف أجيبهولك في الحقيقة، فقولت أجيبه بطريقة تانية.

المهم أنا فعلًا بحبك، وعايز أكمل معاكي وأفضل جنبك.

ومتخافيش، مش هزهق منك، وعمري ما أقدر أزهق من حد بحبه الحب ده كله، حتى لو زعلت تاني، مش هزهق منك.

نعتبر إني بتقدملك...

هاا موافقة؟ 😂`,

    yesButton:"أيوه طبعااا",

    noButton:"إنت هتصاحبني ولا إيه"

},

ringNo:{

    type:"message",

    text:`يبت خلاص بقا انا تعبت 😂`,

    buttons:[

        {
            text:"خلاص موافقه",
            next:"ending"
        }

    ]

},

ending:{

    type:"ending"

},

pathChoice:{

    type:"message",

    title:"عايزة تدخلي على إيه ؟🫣",

    text:"",

    buttons:[

        {
            text:"فكرة الموقع 💗",
            next:"intro"
        },

        {
            text:"عيد ميلاد البطه 2026 🎂🐣",
            next:"birthday2026"
        }

    ]

},

birthday2026:{

    type:"link",

    title:"دوسي هنا علشان تفتحي الموقع",

    linkText:"🌹🌷💗",

    url:"https://egreet.in/bouquet/sweet18-ya-ro7y",

    next:"afterBirthday"

},
    
    afterBirthday:{

    type:"message",

    text:`كان نفسي اكتب اكتر عموما بس للأسف في ليمت لعدد الحروف بس ممكن اكمل هنا عادي اظن مسموحلي اتكلم براحتي`,

    buttons:[

        {
            text:"كمل",
            next:"afterFlower"
        }

    ]

},

afterFlower:{

    type:"message",

    text:`قولت ابعتهالك بدري شويه علشان متبقيش مشغوله اوي وتعرفي تشوفيها كويس وتنبسطي بيها أو يعني اتمنى تبسطك عموما لو مش عارفه ف فكراها اني انا اللي بنقي الورد ده ورده ورده وبرتبه وبختار الزرع الاخضر اللي وراه يعني حسيتها حاجه كان نفسي اعملها في الحقيقه بس معرفتش ف عملتهالك في ويبسايت ولو على الاقل خلتك تبتسمي شويه ف انا كده هكون حققت اللي انا عايزه من كل ده حتى لو فرحتك فرحه صغيره دي كفايا ودي حاجه كبيره عندي ❤️❤️`,

    buttons:[

        {
            text:"كمل",
            next:"afterFlower2"
        }

    ]

},

afterFlower2:{

    type:"message",

    text:`يمكن بقالي كتير مبقولكيش كلام زي ده ويمكن مش هقوله كتير برضو بعدها بس خليكي عارفه أن حتى واحنا مش كويسين مع بعض فرحتك دي حاجه كبيره عندي ولسا مبحبش اشوفك زعلانه ومقدرش اسيبك لوحدك وانتي زعلانه او تعبانه حتى لو مشغول يمكن في حاجات كتير اتغيرت ويمكن على الاقل انا مبقتش بتعامل زي الاول وبصراحه مقدرش اقول انه بسبب مشاكلنا بس يمكن الضغط اللي انا فيه سبب تاني ل ده بس رغم كل ده وحتى وسط مشاكلنا انتي عارفه انك فارقه معايا ومحبش ابدا اني اخسرك على الاقل ك اخت ويمكن ده مش علشان انا محتاجك جمبي بس علشان انا اللي محتاج اكون جمبك عارف اني مش بفرق في حاجه اوي يعني اغلب المشاكل مش بعرها غير بعدها ولو عرفت مش هقدر اعمل حاجه اوي بس مبحبش فكرة ان ممكن يحصلك مشكله وانا بعيد أو تعوزيني ومكونش موجود على الاقل لو حصل حاجه اكون عارف واقدر اكون جمبك وبكون مبسوط جدا لما بقدر اساعدك في حاجه حتى لو تافهه جدا زي معلومه عن مدرس او اشرحلك سؤال او اي حاجه🫂🤍🖇️`,

    buttons:[

        {
            text:"كمل",
            next:"afterBirthdayExtra"
        }

    ]

},

    afterBirthdayExtra:{

    type:"message",

    text:`ومعرفش ليه بس في حاجات كتير جدا بعملها من غير ما استنى مقابل او حتى من غير ما استناكي تعرفي زي ما كنت بعد ل عيد ميلادك الاول من غير ما تعرفي وكنت ممكن اكمل كده لحد يوم عيد ميلادك عادي معنديش مشكله او لما جيبتلك الشكولاته ومكنتش مستني حتى مقابل شكر يمكن بعمل الحاجات دي علشان انا اللي عايز اعملها أو يمكن علشان لسا عايز ابسطك ولو حاجه بسيطه يعني حتى لو مديتيش ردة فعل كويسه بس ممكن تكوني انبسطي ومجرد أن في احتمال ده اللي هيفرق معايا ومش علشان حاجه أو علشان مستني حاجه او حتى اني مستني أننا نبقا احسن أو زي الاول انا بس بعمل الحاجات دي في المطلق ومش مستني حاجه هي بس حاجه من جوايا 🤍🤍🖇️`,

    buttons:[

        {
            text:"كمل",
          next:"afterBirthdayExtra2"
        }

    ]

},

    afterBirthdayExtra2:{

    type:"message",

    text:`وبما اني مش هقول الكلام ده تاني كتير أو يمكن مقولوش ف برضو عايزك تعرفي اني لسا بضحك لما الاقيكي بتضحكي في فويس على حاجه تافهه ولسا بنبسط بيكي وببقا انا مبسوط لما بقعد اسمعلك حاجه زي لما كنت بسمعلك الكيميا انتي بعتي اول فويس بتفتكري فيه حاجه انا كنت مبسوط وانا بسمعه ف فضلت اسأل على حاجات تانيه علشان تكملي كلام 😂❤️🐥`,

    buttons:[

        {
            text:"كمل",
            next:"afterBirthdayExtra3"
        }

    ]

},

    afterBirthdayExtra3:{

    type:"message",

    text:`يمكن انتي متعرفيش حاجه عني دلوقتي ولا تعرفي انا ببقا متضايق امتى ولا مخنوق امتى ولا المشاكل اللي بتحصلي ولا امتى بحتاج حد جمبي وبلاقي ولا امتى بحتاج حد ومبلاقيش بس وسط كل اللي فارق معايا أن انا اللي اكون جمبك وحتى لو انا مخنوق ومتدمر وجيتي تتكلمي بتعامل عادي ولو مضايقه بسمعك واتكلم معاكي وافضل اهديكي او لو بتهزري ساعات بهزر وانا مش قادر اهزر او اضحك وطبعا مش بقول اني ديما ببقا كده يعني عادي اوقات ببقا مش مخنوق وبتكلم وبهزر عادي بس يمكن ده علشان زي ما قولتلك قبل كده انا تقريبا بكلمك علشان ابقا جمبك مش اي حاجه تانيه🫂❤️🖇️`,

    buttons:[

        {
            text:"كمل",
           next:"afterBirthdayExtra4"
        }

    ]

},

    afterBirthdayExtra4:{

    type:"message",

    text:`وكالعاده رغيت كتير اوي في حاجات يمكن يكون ملهاش لزمه ومش عارف لو في حاجات منها مش هبعتها اهو ده بقا عيب اني ابدأ احضر للعيد ميلاد بدري انا بحضر الحاجه من يوم 6 ولحد عيد ميلادك اي حاجه هتيجي في دماغي اكتبها او اغيرها علشان احاول ابعتلك احسن حاجه 😂❤️`,

    buttons:[

        {
            text:"كمل",
          next:"afterBirthdayExtra5"
        }

    ]

},

    afterBirthdayExtra5:{

    type:"message",

    text:`كل سنه وانتي طيبه يا انضف واطيب حد عرفته واجمل كتكوته تتم ال18 🐣💗🫶🫶🌍

Enjoy your day sweetie 🫶🌍`,

    buttons:[

        {
            text:"كمل",
            next:"afterBirthdayExtra6"
        }

    ]

},

    afterBirthdayExtra6:{

    type:"message",

    text:`عموما يعني ارخم حد يتم ال 18 السنادي أو يتمها على العموم بس البطه خلاص كبرت بقا وجابت السن القانوني خلاص حاولت اعمل حاجه لزيزه تفرحك واتمنى تكون فرحتك لو حاجه صغيره اوي هكون مبسوط جدا ساعتها وخدي بالك انا مجمع البوكيه ده بنفسي على فكره 😂❤️

كل سنه وانتي طيبه يدودي وعقبال مليون سنه مع اللي بتحبيهم وبيحبوكي واشوفك احسن دكتوره في الدنيا يارب ❤️❤️🌍🌍🫶`,

    buttons:[

        {
            text:"كمل",
            next:"birthdayChoice"
        }

    ]

},

    birthdayChoice:{

    type:"message",

    text:`لما قولتلك النهارده تختاري رقم من واحد لعشره 😂

الارقام الفرديه (1,3,5,7,9) : مش هبعت كل اللي انا كاتبه علشان كتير اوي وحاسه ملوش لزمه 😃

الارقام الزوجيه (2,4,6,8,10) : هبعته كله علشان كالعاده انا بقول الكلام علشان انا اللي عايز أقوله علشان انا حاسس بيه كده

افتكري أن انتي اللي اختارتي مش انا 😂`,

    buttons:[

        {
            text:"كمل",
          next:"afterBirthday3"
        }

    ]

},

    afterBirthday3:{

    type:"message",

    text:`انتي اختارتي 8 بس انا مكنتش حابب ابعت الحاجه علشان كنت حاسسها كتير اوفر وهي فعلا كتير وكنت حاسس ان الكلام مش حلو اصلا ومش هيعجبك ومش كلام يليق ب عيد ميلاد وبعت اخر حاجه بس ، و في الاخر بعته كله بس بعدها ب شويه 💗🫶🏻`,

    buttons:[

        {
            text:"كمل",
            next:"afterBirthdayFinal"
        }

    ]

},

 afterBirthdayFinal:{

    type:"message",

    text:`انا يمكن مكتبتش حاجه جديده علشان يبقا نفس الكلام اللي قريتيه اول مره ونفس الذكره بس بذلت مجهود جديد يمكن دي حاجه متفرقش اوي بس حبيت اخلي كل حاجه تخصك وكل حاجه ممكن تفرحك في مكان واحد يمكن مودك ميبقاش احسن حاجه تخشي الموقع هنا تفتكري أن في حد فعلا بيحبك ومستنيكي حتى لو تعبت أو فقدت الامل ف ممكن ابطل احاول بس مش هيمنع اني لسا مستنيكي وبحبك مهما بطلت اقولها 🔐🫂🌍`,

    buttons:[

        {
            text:"نقول تاني",
            next:"pathChoice"
        }

    ]

}

};
